sichuan/COMP_ResourcePoolProxy/src/test/resources/NewFile.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<ns3:Authorization xmlns:ns3="http://www.idc.com/idc/schemas/" xmlns:ns2="http://www.idc.com/idc/idc.wsdl">
			<IDCAccessId>CIDC-RP-01</IDCAccessId>
			<IDCPwd>70b5104ebc208645c0746b3b76f4e3bc</IDCPwd>
			<Timestamp>2015-01-20 16:42:00</Timestamp>
			<TransactionID>CIDC-RP-012015-01-20 16:41:5900074611</TransactionID>
		</ns3:Authorization>
	</soap:Header>
	<soap:Body>
		<ns3:ReportConfigurationInfoByDataReq xmlns:ns2="http://www.idc.com/idc/idc.wsdl"
			xmlns:ns3="http://www.idc.com/idc/schemas/">
			<ConfigurationInfoList>
				<ConfigurationInfo>
					<InstanceId>CIDC-R-01-000-BS-00000027</InstanceId>
					<CIID>CIDC-EBlockStorage</CIID>
					<CIAttributeInfoList>
						<CIAttributeInfo>
							<CIAttributeID>eqp_id</CIAttributeID>
							<CIAttributeValue>CIDC-R-01-000-BS-00000027</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_name</CIAttributeID>
							<CIAttributeValue>0202</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>vol_status</CIAttributeID>
							<CIAttributeValue>2</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>vol_size</CIAttributeID>
							<CIAttributeValue>10</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>rc_id</CIAttributeID>
							<CIAttributeValue>CIDC-RP-01</CIAttributeValue>
						</CIAttributeInfo>
					</CIAttributeInfoList>
					<CreationTime>2015-01-20 16:47:00</CreationTime>
					<LastUpdateTime>2015-01-20 16:47:00</LastUpdateTime>
					<Status>1</Status>
				</ConfigurationInfo>
				<ConfigurationInfo>
					<InstanceId>CIDC-R-01-100-SRV-00000460</InstanceId>
					<CIID>CIDC-PhysicalMachine</CIID>
					<CIAttributeInfoList>
						<CIAttributeInfo>
							<CIAttributeID>eqp_serialnum</CIAttributeID>
							<CIAttributeValue>123456</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>hba_type</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cpu_type</CIAttributeID>
							<CIAttributeValue>AMD</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>rc_id</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>ethada_num</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_id</CIAttributeID>
							<CIAttributeValue>CIDC-R-01-100-SRV-00000460</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cpu_frequency</CIAttributeID>
							<CIAttributeValue>2.5</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>memory_size</CIAttributeID>
							<CIAttributeValue>4096</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>server_type</CIAttributeID>
							<CIAttributeValue>Dell</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_ip</CIAttributeID>
							<CIAttributeValue>10.10.125.85</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>scsiada_num</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cpu_num</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>powermodule_num</CIAttributeID>
							<CIAttributeValue>12</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>hba_num</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>ethada_type</CIAttributeID>
							<CIAttributeValue>2</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>app_id</CIAttributeID>
							<CIAttributeValue></CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>if_num</CIAttributeID>
							<CIAttributeValue>2</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>mainbord_num</CIAttributeID>
							<CIAttributeValue>12</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>fan_num</CIAttributeID>
							<CIAttributeValue>12</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>memory_num</CIAttributeID>
							<CIAttributeValue>13</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cur_status</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>os_type</CIAttributeID>
							<CIAttributeValue>12</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>used_flag</CIAttributeID>
							<CIAttributeValue>1</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>disk_num</CIAttributeID>
							<CIAttributeValue>124</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>disk_size</CIAttributeID>
							<CIAttributeValue>24</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_name</CIAttributeID>
							<CIAttributeValue>fy0120</CIAttributeValue>
						</CIAttributeInfo>
					</CIAttributeInfoList>
					<CreationTime>2015-01-20 16:46:00</CreationTime>
					<LastUpdateTime>2015-01-20 16:46:00</LastUpdateTime>
					<Status>1</Status>
				</ConfigurationInfo>
				<ConfigurationInfo>
					<InstanceId>99999999</InstanceId>
					<CIID>CPC-RT-MC</CIID>
					<!--Zero or more repetitions: -->
					<CIAttributeInfoList>
						<CIAttributeInfo>
							<CIAttributeID>rc_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>instance_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_name</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_ip</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_netmask</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cluster_ip</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>vendor_name</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>server_type</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cpu_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cpu_type</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cpu_frequency</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>memory_size</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>memory_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>os_type</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>disk_size</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>disk_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>if_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>mainbord_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>powermodule_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>fan_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cur_status</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>app_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>zone_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>switch_if_relations</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_serialnum</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>asset_origin_type</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>asset_state</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>asset_sla_type</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>Object_Zone_ID</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>Object_Cluster_ID</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
					</CIAttributeInfoList>


					<CreationTime>2015-01-20 16:47:00</CreationTime>
					<LastUpdateTime>2015-01-20 16:47:00</LastUpdateTime>
					<Status>1</Status>
				</ConfigurationInfo>



				<ConfigurationInfo>
					<InstanceId>99999999</InstanceId>
					<CIID>CPC-RT-MCP</CIID>
					<!--Zero or more repetitions: -->
					<CIAttributeInfoList>
						<CIAttributeInfo>
							<CIAttributeID>rc_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>instance_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_name</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_ip</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>eqp_netmask</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cluster_ip</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>mem_size</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>os_type</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>disk_size</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>swap_capacity</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>cur_status</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>app_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>zone_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>v_ethada_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>v_scsiada_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>v_fchba_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>vm_os</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>v_processor_num</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>v_processor_frequency</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>parent_id</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
						<CIAttributeInfo>
							<CIAttributeID>switch_if_relations</CIAttributeID>
							<CIAttributeValue>4</CIAttributeValue>
						</CIAttributeInfo>
					</CIAttributeInfoList>


					<CreationTime>2015-01-20 16:47:00</CreationTime>
					<LastUpdateTime>2015-01-20 16:47:00</LastUpdateTime>
					<Status>1</Status>
				</ConfigurationInfo>
			</ConfigurationInfoList>
		</ns3:ReportConfigurationInfoByDataReq>
	</soap:Body>
</soap:Envelope>